{"backend": "tensorflow", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 250], "output_dim": 300, "dtype": "float32", "input_dim": 80000, "mask_zero": false, "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "name": "embedding_1", "embeddings_regularizer": null, "input_length": 250, "activity_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "filters": 64, "strides": [1], "kernel_size": [5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "padding": "valid", "name": "conv1d_1", "kernel_regularizer": null, "dilation_rate": [1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [4], "strides": [4], "name": "max_pooling1d_1", "trainable": true, "padding": "valid"}}, {"class_name": "LSTM", "config": {"activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.2, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "name": "lstm_1", "dropout": 0.2, "unit_forget_bias": true, "return_sequences": false, "activity_regularizer": null, "kernel_constraint": null, "return_state": false, "kernel_regularizer": null, "bias_constraint": null, "units": 128, "unroll": false, "recurrent_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}], "class_name": "Sequential", "keras_version": "2.1.5"}