{"keras_version": "2.1.5", "backend": "tensorflow", "config": [{"config": {"output_dim": 300, "input_dim": 80000, "trainable": true, "embeddings_constraint": null, "embeddings_regularizer": null, "name": "embedding_1", "mask_zero": false, "input_length": 250, "activity_regularizer": null, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "dtype": "float32", "batch_input_shape": [null, 250]}, "class_name": "Embedding"}, {"config": {"dilation_rate": [1], "strides": [1], "trainable": true, "bias_regularizer": null, "filters": 64, "bias_constraint": null, "padding": "same", "name": "conv1d_1", "kernel_size": [3], "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true}, "class_name": "Conv1D"}, {"config": {"dilation_rate": [1], "strides": [1], "trainable": true, "bias_regularizer": null, "filters": 32, "bias_constraint": null, "padding": "same", "name": "conv1d_2", "kernel_size": [3], "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true}, "class_name": "Conv1D"}, {"config": {"dilation_rate": [1], "strides": [1], "trainable": true, "bias_regularizer": null, "filters": 16, "bias_constraint": null, "padding": "same", "name": "conv1d_3", "kernel_size": [3], "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true}, "class_name": "Conv1D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"units": 180, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "name": "dense_1", "activity_regularizer": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"units": 1, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "name": "dense_2", "activity_regularizer": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}